#+STARTUP: indent
#+OPTIONS: toc:nil num:nil
#+TITLE: ECON 384 HW1
#+SETUPFILE: my_heading.org

#+LATEX: \linespread{1.5}

* Question 3

1. The prospect is identical to that of Question 1, part (a)
   | $w_-$, $ | $w_+$, $ | $p_-$ | $\mathfrac{E}[P]$, $ | $\mathfrac{V}[P]$, $ | $\Xi$, $ |
   | /        |          |       |                      |                      | <        |
   |----------+----------+-------+----------------------+----------------------+----------|
   | 50       |      650 |  0.75 |                200.0 |              67500.0 | 136.35   |
   #+TBLFM: $4='(org-sbe "prospect_mean" (wm $1) (wp $2) (pm $3))::$5='(org-sbe "prospect_var" (wm $1) (wp $2) (pm $3))'::$6='(org-sbe "bet_val" (wm $1) (wp $2) (pm $3))';%.2f

2. Same as in Question 1: no bet larger that $\Xi=136.35$ should be
   placed on this lottery. The cut-off value does *not* depend on
   $\alpha$.

3. Omitting further parts of the question which are identical to Question 1

4. We already know that the original lottery is infeasible, for any
   value of $\alpha>0$.  Diversification: For the alternative lottery,
   the payoffs for both states of the world at $t=1$ are given in the
   table below

   | time                           | t=0 | t=1; low oil | t=1; high oil |
   | /                              |   < |              |               |
   |--------------------------------+-----+--------------+---------------|
   | oil stock price, $             |  10 |         2.50 |         32.50 |
   | plastics stock price, $        |   5 |        25.00 |             1 |
   | nr. oil shares                 |  10 |           10 |            10 |
   | nr. plastics shares            |  20 |           20 |            20 |
   |--------------------------------+-----+--------------+---------------|
   | total value, oil stock, $      | 100 |        25.00 |        325.00 |
   | total value, plastics stock, $ | 100 |       500.00 |         20.00 |
   |--------------------------------+-----+--------------+---------------|
   | total payout                   |     |       525.00 |        345.00 |
   #+TBLFM: @5$2=@7$2/@3$2::@6$2=@8$2/@4$2::@7$3=@3$3*@5$3;%.2f::@8$3=@4$3*@6$3;%.2f::@>$3=vsum(@II..@III);%.2f::@7$4=@3$4*@5$4;%.2f::@8$4=@4$4*@6$4;%.2f::@>$4=vsum(@II..@III);%.2f

   The prospect corresponding to this alternative lottery is therefore
   | $w_-$, $ | $w_+$, $ | $p_-$ | $\mathfrac{E}[P]$, $ | $\Xi$, $ |
   | /        |          |       |                      | <        |
   |----------+----------+-------+----------------------+----------|
   | 345      |      525 |  0.25 |                480.0 | 476.47   |
   #+TBLFM: $4='(org-sbe "prospect_mean" (wm $1) (wp $2) (pm $3))::$5='(org-sbe "bet_val" (wm $1) (wp $2) (pm $3))';%.2f

   We see that it is feasible to bet any amount on this lottery up to $\Xi=476.47$, so the bet of $200 is certainly feasible.

* Question 4
- The CAPM discont rate $r_i= r_m\beta + r_f(1-\beta)$. For the example
  at hand, $100\%\cdot r_i= 4\% + 1.8\cdot (12\%-4\%) = 18.4\%$. The
  discounted payoff in period $t$ is given by $P(t)/r_i^t=P(t)/1.184^t$
  for $t=0,\ldots6$, and the NPV of the revenue stream under the CAPM
  rate is given as follows
  | period            |       0 |     1 |     2 |     3 |     4 |     5 |     6 | NPV    |
  | /                 |       < |       |       |       |       |       |       | <      |
  |-------------------+---------+-------+-------+-------+-------+-------+-------+--------|
  | payoff, $k        |    -200 |    20 |    30 |  40.5 |    50 |  60.5 |  60.5 |        |
  | discounted payoff | -200.00 | 16.89 | 21.40 | 24.40 | 25.44 | 26.00 | 21.96 | -63.91 |
  #+TBLFM: @>$2..@>$8=@3/(1.184^@1);%.2f::@>$>=vsum($2..$8);%.2f
  Since the NPV is negative, the investment should *not* be pursued.

- Recalculate for $\beta=0.20$: $100\%\cdot r_i = 4\% + 0.2\cdot(12\%-4\%) = 5.6\%$, so that
  | period            |       0 |     1 |     2 |     3 |     4 |     5 |     6 | NPV   |
  | /                 |       < |       |       |       |       |       |       | <     |
  |-------------------+---------+-------+-------+-------+-------+-------+-------+-------|
  | payoff, $k        |    -200 |    20 |    30 |  40.5 |    50 |  60.5 |  60.5 |       |
  | discounted payoff | -200.00 | 18.94 | 26.90 | 34.39 | 40.21 | 46.07 | 43.63 | 10.14 |
  #+TBLFM: @>$2..@>$8=@3/(1.056^@1);%.2f::@>$>=vsum($2..$8);%.2f
  Under the significantly lower CAPM discount rate of $5.6\%$, the NPV
  of the investment is positive; the investment is feasible.

- The discounted payoff for each period $t$ is given by $w_\pm\delta^t
  = w_\pm/1.05^t$, its utility is
  $u(w_\pm/1.05^t)=\sqrt{w_\pm)/1.05^{t/2}$, and the expected utility
  is therefore $u=\sum_{t=1}^6\,u(w_-\delta^t)p_- + u(w_+\delta^t)p_+ =


  | period $t$       | 1 | 2 | 3 | 4 | 5 | 6 |
  |------------------+---+---+---+---+---+---|
  | $w_-$, $k        |   |   |   |   |   |   |
  | $w_+$, $k        |   |   |   |   |   |   |
  |------------------+---+---+---+---+---+---|
  | discounted $w_-$ |   |   |   |   |   |   |
  | discounted $w_+$ |   |   |   |   |   |   |

